### Terraform Plan
<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.this will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "use1-development-testLambda"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "TerraformModule" = "api-gateway"
        }
      + tags_all                     = {
          + "TerraformModule" = "api-gateway"
        }

      + cors_configuration {
          + allow_headers  = [
              + "*",
            ]
          + allow_methods  = [
              + "*",
            ]
          + allow_origins  = [
              + "*",
            ]
          + expose_headers = [
              + "*",
            ]
          + max_age        = 1000
        }
    }

  # aws_apigatewayv2_api_mapping.this will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # aws_apigatewayv2_domain_name.this will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "use1-testLambda.example.com"
      + id                               = (known after apply)
      + tags                             = {
          + "TerraformModule" = "api-gateway"
        }
      + tags_all                         = {
          + "TerraformModule" = "api-gateway"
        }

      + domain_name_configuration {
          + certificate_arn                        = "arn:aws:acm:us-east-1:000000000000:certificate/e42210ee-b457-484f-a4bd-2c9bdbc20616"
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # aws_apigatewayv2_integration.this will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Lambda proxy integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:000000000000:function:use1-development-testLambda"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.this will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.this will be created
  + resource "aws_apigatewayv2_stage" "this" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "TerraformModule" = "api-gateway"
        }
      + tags_all      = {
          + "TerraformModule" = "api-gateway"
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 0
          + throttling_rate_limit    = 0
        }
    }

  # aws_lambda_permission.apigw_lambda_permission will be created
  + resource "aws_lambda_permission" "apigw_lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "arn:aws:lambda:us-east-1:000000000000:function:use1-development-testLambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_route53_record.this will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "use1-testlambda.example.com"
      + type            = "A"
      + zone_id         = "F9YCSMJ6POJ1NBT"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api            = {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + body                         = null
      + cors_configuration           = [
          + {
              + allow_credentials = null
              + allow_headers     = [
                  + "*",
                ]
              + allow_methods     = [
                  + "*",
                ]
              + allow_origins     = [
                  + "*",
                ]
              + expose_headers    = [
                  + "*",
                ]
              + max_age           = 1000
            },
        ]
      + credentials_arn              = null
      + description                  = null
      + disable_execute_api_endpoint = null
      + execution_arn                = (known after apply)
      + fail_on_warnings             = null
      + id                           = (known after apply)
      + name                         = "use1-development-testLambda"
      + protocol_type                = "HTTP"
      + route_key                    = null
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "TerraformModule" = "api-gateway"
        }
      + tags_all                     = {
          + "TerraformModule" = "api-gateway"
        }
      + target                       = null
      + version                      = null
    }
  + apig_stage     = {
      + access_log_settings    = []
      + api_id                 = (known after apply)
      + arn                    = (known after apply)
      + auto_deploy            = true
      + client_certificate_id  = null
      + default_route_settings = [
          + {
              + data_trace_enabled       = false
              + detailed_metrics_enabled = true
              + logging_level            = (known after apply)
              + throttling_burst_limit   = 0
              + throttling_rate_limit    = 0
            },
        ]
      + deployment_id          = (known after apply)
      + description            = null
      + execution_arn          = (known after apply)
      + id                     = (known after apply)
      + invoke_url             = (known after apply)
      + name                   = "$default"
      + route_settings         = []
      + stage_variables        = null
      + tags                   = {
          + "TerraformModule" = "api-gateway"
        }
      + tags_all               = {
          + "TerraformModule" = "api-gateway"
        }
    }
  + route53_record = {
      + alias                            = [
          + {
              + evaluate_target_health = false
              + name                   = (known after apply)
              + zone_id                = (known after apply)
            },
        ]
      + allow_overwrite                  = true
      + failover_routing_policy          = []
      + fqdn                             = (known after apply)
      + geolocation_routing_policy       = []
      + health_check_id                  = null
      + id                               = (known after apply)
      + latency_routing_policy           = []
      + multivalue_answer_routing_policy = null
      + name                             = "use1-testlambda.example.com"
      + records                          = null
      + set_identifier                   = null
      + ttl                              = null
      + type                             = "A"
      + weighted_routing_policy          = []
      + zone_id                          = "F9YCSMJ6POJ1NBT"
    }

```

</details>